<?
ini_set('display_errors', 1);
ini_set('error_reporting', E_ALL);

// display warnings and errors
error_reporting(E_WARNING | E_ERROR);


require_once("lib.inc.php");

$GLOBAL_SESSION=returnsession();


if($_GET['action2']=="MakeShiJuan"&&$_GET['试卷标题']!='')			{
	page_css("开始生成试卷");
	$sql = "select * from tiku_shijuan where 试卷标题='".$_GET['试卷标题']."'";
	$rs = $db->Execute($sql);
	$rs_a = $rs->GetArray();
	//print_R($rs_a);
	//Array ( [0] => Array ( [编号] => 9 [试卷标题] => 2008级新视野英语大二考试试卷 [试卷总分] => 180 [考试时长] => 120 [所属课程库] => 营养师 [试卷说明] => [题目类型一] => 单选 [题目个数一] => 20 [单题分值一] => 2 [题目说明一] => [题目类型二] => 问答 [题目个数二] => 20 [单题分值二] => 2 [题目说明二] => [题目类型三] => 单选 [题目个数三] => 0 [单题分值三] => 0 [题目说明三] => [题目类型四] => 单选 [题目个数四] => 0 [单题分值四] => 0 [题目说明四] => [题目类型五] => 单选 [题目个数五] => 0 [单题分值五] => 0 [题目说明五] => [题目类型六] => 单选 [题目个数六] => 0 [单题分值六] => 0 [题目说明六] => [题目类型七] => 单选 [题目个数七] => 0 [单题分值七] => 0 [题目说明七] => [题目类型八] => 单选 [题目个数八] => 0 [单题分值八] => 0 [题目说明八] => [题目类型九] => 单选 [题目个数九] => 0 [单题分值九] => 0 [题目说明九]
	$所属课程库 = $rs_a[0]['所属课程库'];

	$题目类型一 = $rs_a[0]['题目类型一'];
	$题目个数一 = $rs_a[0]['题目个数一'];
	$单题分值一 = $rs_a[0]['单题分值一'];
	$题目说明一 = $rs_a[0]['题目说明一'];
	if($题目个数一>0&&$单题分值一>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型一,$题目个数一,$单题分值一);

	$题目类型二 = $rs_a[0]['题目类型二'];
	$题目个数二 = $rs_a[0]['题目个数二'];
	$单题分值二 = $rs_a[0]['单题分值二'];
	$题目说明二 = $rs_a[0]['题目说明二'];
	if($题目个数二>0&&$单题分值二>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型二,$题目个数二,$单题分值二);

	$题目类型三 = $rs_a[0]['题目类型三'];
	$题目个数三 = $rs_a[0]['题目个数三'];
	$单题分值三 = $rs_a[0]['单题分值三'];
	$题目说明三 = $rs_a[0]['题目说明三'];
	if($题目个数三>0&&$单题分值三>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型三,$题目个数三,$单题分值三);

	$题目类型四 = $rs_a[0]['题目类型四'];
	$题目个数四 = $rs_a[0]['题目个数四'];
	$单题分值四 = $rs_a[0]['单题分值四'];
	$题目说明四 = $rs_a[0]['题目说明四'];
	if($题目个数四>0&&$单题分值四>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型四,$题目个数四,$单题分值四);

	$题目类型五 = $rs_a[0]['题目类型五'];
	$题目个数五 = $rs_a[0]['题目个数五'];
	$单题分值五 = $rs_a[0]['单题分值五'];
	$题目说明五 = $rs_a[0]['题目说明五'];
	if($题目个数五>0&&$单题分值五>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型五,$题目个数五,$单题分值五);

	$题目类型六 = $rs_a[0]['题目类型六'];
	$题目个数六 = $rs_a[0]['题目个数六'];
	$单题分值六 = $rs_a[0]['单题分值六'];
	$题目说明六 = $rs_a[0]['题目说明六'];
	if($题目个数六>0&&$单题分值六>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型六,$题目个数六,$单题分值六);

	$题目类型七 = $rs_a[0]['题目类型七'];
	$题目个数七 = $rs_a[0]['题目个数七'];
	$单题分值七 = $rs_a[0]['单题分值七'];
	$题目说明七 = $rs_a[0]['题目说明七'];
	if($题目个数七>0&&$单题分值七>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型七,$题目个数七,$单题分值七);

	$题目类型八 = $rs_a[0]['题目类型八'];
	$题目个数八 = $rs_a[0]['题目个数八'];
	$单题分值八 = $rs_a[0]['单题分值八'];
	$题目说明八 = $rs_a[0]['题目说明八'];
	if($题目个数八>0&&$单题分值八>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型八,$题目个数八,$单题分值八);

	$题目类型九 = $rs_a[0]['题目类型九'];
	$题目个数九 = $rs_a[0]['题目个数九'];
	$单题分值九 = $rs_a[0]['单题分值九'];
	$题目说明九 = $rs_a[0]['题目说明九'];
	if($题目个数九>0&&$单题分值九>0)MakeShiJuan($_GET['试卷标题'],$所属课程库,$题目类型九,$题目个数九,$单题分值九);


	print_nouploadfile("试卷已经生成完成");

	exit;
}


function MakeShiJuan($试卷标题,$课程库,$题型,$个数,$分值)			{
	global $db;

	$sql = "delete from tiku_shijuanku where 试卷名称='$试卷标题' and 课程库='$课程库' and 题型='$题型'";
	$db->Execute($sql);

	$from = rand(0,2);
	$sql = "select * from tiku_shiti where 课程库='$课程库' and 题型='$题型' limit $from , $个数";
	$rs = $db->Execute($sql);
	$rs_a = $rs->GetArray();
	for($i=0;$i<sizeof($rs_a);$i++)		{
		$Elmenet['试卷名称'] = $试卷标题;
		$Elmenet['课程库'] = $课程库;
		$Elmenet['课程库'] = $rs_a[$i]['课程库'];
		$Elmenet['知识点'] = $rs_a[$i]['知识点'];
		$Elmenet['难易程度'] = $rs_a[$i]['难易程度'];
		$Elmenet['题型'] = $rs_a[$i]['题型'];
		$Elmenet['题目'] = $rs_a[$i]['题目'];
		$Elmenet['分值'] = $分值;
		$Elmenet['备选答案A'] = $rs_a[$i]['备选答案A'];
		$Elmenet['备选答案B'] = $rs_a[$i]['备选答案B'];
		$Elmenet['备选答案C'] = $rs_a[$i]['备选答案C'];
		$Elmenet['备选答案D'] = $rs_a[$i]['备选答案D'];
		$Elmenet['备选答案E'] = $rs_a[$i]['备选答案E'];
		$Elmenet['备选答案F'] = $rs_a[$i]['备选答案F'];
		$Elmenet['正确答案'] = $rs_a[$i]['正确答案'];
		$Elmenet['解释'] = $rs_a[$i]['解释'];
		$Elmenet['题型'] = $rs_a[$i]['题型'];
		$ElementValue = @array_values($Elmenet);
		$sql = "insert into tiku_shijuanku values('','".join("','",$ElementValue)."');";
		$db->Execute($sql);
		//print $sql."<BR>";
	}
}






$filetablename='tiku_shijuan';
require_once('include.inc.php');
?>